КанцОптТорг/src/Documents/ЗаполнениеГрафика/ЗаполнениеГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаполнениеГрафика</name>
  <registerRecords>InformationRegister.График</registerRecords>
</mdclass:Document>

КанцОптТорг/src/InformationRegisters/График/График.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>График</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РабочийДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КанцОптТорг/src/Documents/ЗаполнениеГрафика/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТекущаяДата = НачалоГода(Дата);
	КонецГода = КонецГода(Дата); 
	Движения.График.Записывать = Истина;
	Пока ТекущаяДата <= КонецГода Цикл
		
		Движение = Движения.График.Добавить();
		Движение.Дата = ТекущаяДата; 
		ДеньНедели = ДеньНедели(ТекущаяДата);
		Если ДеньНедели <=5 Тогда
			Движение.РабочийДень = 1;
		Иначе 
			Движение.РабочийДень = 0;
		КонецЕсли;
		ТекущаяДата =ТекущаяДата+24*3600;
	КонецЦикла;
	
КонецПроцедуры
